vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <condition id="device.MIMXRT1176.internal_condition">
      <accept Dname="MIMXRT1176AVM8A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176AVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176CVM8A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176CVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176DVMAA" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176DVMAB" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1170, component.flexspi_nor_flash_adapter_rt1170, allOf=board=evkbmimxrt1170, component.flexspi_nor_flash_adapter_rt1170evkb, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1170, component.flexspi_nor_flash_adapter_rt1170, allOf=board=evkbmimxrt1170, component.flexspi_nor_flash_adapter_rt1170evkb, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1170, component.flexspi_nor_flash_adapter_rt1170, allOf=board=evkbmimxrt1170, component.flexspi_nor_flash_adapter_rt1170evkb.internal_condition"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1170, component.flexspi_nor_flash_adapter_rt1170, allOf=board=evkbmimxrt1170, component.flexspi_nor_flash_adapter_rt1170evkb.internal_condition">
      <accept condition="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
      <accept condition="allOf.board=evkmimxrt1170, component.flexspi_nor_flash_adapter_rt1170.internal_condition"/>
      <accept condition="allOf.board=evkbmimxrt1170, component.flexspi_nor_flash_adapter_rt1170evkb.internal_condition"/>
    </condition>
    <condition id="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcxw_flash_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="allOf.board=evkmimxrt1170, component.flexspi_nor_flash_adapter_rt1170.internal_condition">
      <require condition="board.evkmimxrt1170.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="adapter_rt1170"/>
    </condition>
    <condition id="board.evkmimxrt1170.internal_condition">
      <accept condition="device.MIMXRT1171.internal_condition"/>
      <accept condition="device.MIMXRT1172.internal_condition"/>
      <accept condition="device.MIMXRT1173.internal_condition"/>
      <accept condition="device.MIMXRT1175.internal_condition"/>
      <accept condition="device.MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkbmimxrt1170, component.flexspi_nor_flash_adapter_rt1170evkb.internal_condition">
      <require condition="board.evkbmimxrt1170.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="adapter_rt1170evkb"/>
    </condition>
    <condition id="board.evkbmimxrt1170.internal_condition">
      <accept condition="device.MIMXRT1171.internal_condition"/>
      <accept condition="device.MIMXRT1172.internal_condition"/>
      <accept condition="device.MIMXRT1173.internal_condition"/>
      <accept condition="device.MIMXRT1175.internal_condition"/>
      <accept condition="device.MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="component.flash_nand_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexspi, device=MIMXRT1171.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.flash_nand_semc.condition_id">
      <require condition="allOf.driver.semc, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.driver.semc, device=MIMXRT1171.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="semc"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_lpspi.condition_id">
      <require condition="allOf.driver.lpspi, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device=MIMXRT1171.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.flexspi_nor_flash_adapter_rt1170.condition_id">
      <require condition="allOf.board=evkmimxrt1170, driver.flexspi, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkmimxrt1170, driver.flexspi, device=MIMXRT1171.internal_condition">
      <require condition="board.evkmimxrt1170.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.flexspi_nor_flash_adapter_rt1170evkb.condition_id">
      <require condition="allOf.board=evkbmimxrt1170, driver.flexspi, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkbmimxrt1170, driver.flexspi, device=MIMXRT1171.internal_condition">
      <require condition="board.evkbmimxrt1170.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.gpt_adapter.condition_id">
      <require condition="allOf.driver.gpt, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.driver.gpt, device=MIMXRT1171.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpt"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.gpt_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.gpt, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition">
      <accept condition="allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition"/>
    </condition>
