vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-hx8394.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-it6161.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-it6263.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-mipi-dsi-cmd.condition_id">
      <require condition="allOf.anyOf=driver.mipi_dsi_split, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.mipi_dsi_split, driver.common, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.mipi_dsi_split.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.mipi_dsi_split.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mipi_dsi_split"/>
    </condition>
    <condition id="driver.display-rm67162.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-rm67191.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-rm68191.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-rm68200.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-rm692c9.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-rpi.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.display-sn65dsi83.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.driver.common, driver.dmamux, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dmamux, device_id=MIMXRT1171xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require condition="device_id.MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.enc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.enet.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.ewm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexcan.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexcan_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexcan, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexcan, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MIMXRT1171xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexio_i2s, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexio_i2s, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexio_spi, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexio_spi, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
