vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexio_uart, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexio_uart, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.flexram.condition_id">
      <require condition="allOf.driver.common, driver.flexram_allocate, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexram_allocate, device_id=MIMXRT1171xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_flexram_allocate"/>
      <require condition="device_id.MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexram_allocate.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.flexspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexspi, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexspi, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.ft3267.condition_id">
      <require condition="allOf.device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.ft5406_rt.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MIMXRT1171.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.gpc_xxx_ctrl.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.gpt.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.iee.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.iee_apc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.igpio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.iomuxc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.key_manager.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.kpp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lcdifv2.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
