vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <condition id="allOf.anyOf=driver.edma, driver.pdm, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pdm"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.pgmc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.puf.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.pwm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.qtmr_1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.rdc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.rdc_sema42.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.rtwdog.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.sai.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.sai_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.sai, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.sai, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.sema4.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.semc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT1171.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_emvsim.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_emvsim.condition_id">
      <require condition="allOf.driver.common, driver.smartcard_emvsim, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.smartcard_emvsim, device_id=MIMXRT1171xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim"/>
      <require condition="device_id.MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_uart.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.snvs_hp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.snvs_lp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.spdif.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1171xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.spdif_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.spdif, device=MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.spdif, device=MIMXRT1171.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spdif"/>
      <require condition="device.MIMXRT1171.internal_condition"/>
    </condition>
    <condition id="driver.src_2.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1171.internal_condition"/>
    </condition>
