vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy" Cversion="1.0.0" condition="component.mem_manager_legacy.condition_id">
      <description>Component mem_manager_legacy</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light" Cversion="1.0.0" condition="component.mem_manager_light.condition_id">
      <description>Component mem_manager_light</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager_light.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_offchip" Cversion="1.0.0" condition="component.mflash_offchip.condition_id">
      <description>mflash offchip</description>
      <RTE_Components_h>
#ifndef MFLASH_FILE_BASEADDR
#define MFLASH_FILE_BASEADDR 14221312
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/flash/mflash/mflash_common.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mflash_file.c" projectpath="flash/mflash"/>
        <file category="header" name="components/flash/mflash/mflash_file.h" projectpath="flash/mflash"/>
        <file condition="allOf.boards=evkbmimxrt1170.condition_id" category="sourceC" name="components/flash/mflash/mimxrt1170evkb/mflash_drv.c" projectpath="flash/mflash/mimxrt1170evkb"/>
        <file condition="allOf.boards=evkbmimxrt1170.condition_id" category="header" name="components/flash/mflash/mimxrt1170evkb/mflash_drv.h" projectpath="flash/mflash/mimxrt1170evkb"/>
        <file category="include" name="components/flash/mflash/"/>
        <file condition="allOf.boards=evkbmimxrt1170.condition_id" category="include" name="components/flash/mflash/mimxrt1170evkb/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip" Cversion="1.0.0" condition="component.mflash_onchip.condition_id">
      <description>mflash onchip</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip_fmu" Cversion="1.0.0" condition="component.mflash_onchip_fmu.condition_id">
      <description>mflash onchip_fmu</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_fmu_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter" Cversion="2.0.0" condition="component.pcm186x_adapter.condition_id">
      <description>Component pcm186x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.h" projectpath="codec/port/pcm186x"/>
        <file category="sourceC" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.c" projectpath="codec/port/pcm186x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm186x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter" Cversion="2.0.0" condition="component.pcm512x_adapter.condition_id">
      <description>Component pcm512x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.h" projectpath="codec/port/pcm512x"/>
        <file category="sourceC" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.c" projectpath="codec/port/pcm512x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm512x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-aqr113c" Cversion="2.0.0" condition="component.phyaqr113c.condition_id">
      <description>Driver phy-device-aqr113c</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyaqr113c/fsl_phyaqr113c.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyaqr113c/fsl_phyaqr113c.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyaqr113c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ar8031" Cversion="2.0.0" condition="component.phyar8031.condition_id">
      <description>Driver phy-device-ar8031</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyar8031/fsl_phyar8031.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyar8031/fsl_phyar8031.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyar8031/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-dp8384x" Cversion="2.0.0" condition="component.phydp8384x.condition_id">
      <description>Driver phy-device-dp8384x</description>
      <files>
        <file category="sourceC" name="components/phy/device/phydp8384x/fsl_phydp8384x.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phydp8384x/fsl_phydp8384x.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phydp8384x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-gpy215" Cversion="2.0.0" condition="component.phygpy215.condition_id">
      <description>Driver phy-device-gpy215</description>
      <files>
        <file category="sourceC" name="components/phy/device/phygpy215/fsl_phygpy215.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phygpy215/fsl_phygpy215.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phygpy215/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ksz8041" Cversion="2.0.0" condition="component.phyksz8041.condition_id">
      <description>Driver phy-device-ksz8041</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyksz8041/fsl_phyksz8041.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyksz8041/fsl_phyksz8041.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyksz8041/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ksz8081" Cversion="2.0.0" condition="component.phyksz8081.condition_id">
      <description>Driver phy-device-ksz8081</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyksz8081/fsl_phyksz8081.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyksz8081/fsl_phyksz8081.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyksz8081/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-lan8720a" Cversion="2.0.0" condition="component.phylan8720a.condition_id">
      <description>Driver phy-device-lan8720a</description>
      <files>
        <file category="sourceC" name="components/phy/device/phylan8720a/fsl_phylan8720a.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phylan8720a/fsl_phylan8720a.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phylan8720a/"/>
      </files>
    </component>
