vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1171_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT1171_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT1171/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1171/MIMXRT1171.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1171/MIMXRT1171_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1171/MIMXRT1171_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ADC_ETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ANADIG_LDO_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ANADIG_LDO_SNVS_DIG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ANADIG_MISC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ANADIG_OSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ANADIG_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ANADIG_PMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ANADIG_TEMPSENSOR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_AOI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ASRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_AUDIO_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CAAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CAN_WRAPPER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CCM_OBS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_CSI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DCDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DCIC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DMAMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DSI_HOST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DSI_HOST_APB_PKT_IF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DSI_HOST_DPI_INTFC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_DSI_HOST_NXP_FDSOI28_DPHY_INTFC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_EMVSIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ENC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ENET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ENET_QOS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_ETHERNET_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_FLEXRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_GPC_CPU_MODE_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_GPC_SET_POINT_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_GPC_STBY_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_GPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IEE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IEE_APC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IOMUXC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IOMUXC_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IOMUXC_LPSR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IOMUXC_LPSR_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IOMUXC_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IOMUXC_SNVS_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_IPS_DOMAIN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_KEY_MANAGER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_KPP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_LCDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_LCDIFV2.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_LMEM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_MECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_MIPI_CSI2RX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_MMCAU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_OCOTP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_OSC_RC_400M.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_OTFAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PGMC_BPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PGMC_CPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PGMC_MIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PGMC_PPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PHY_LDO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PIT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_PXP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_RDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_RDC_SEMAPHORE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_RTWDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SEMA4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SEMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SPDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SSARC_HP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_SSARC_LP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_TMPSNS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_VIDEO_MUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_VIDEO_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_VMBANDGAP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_WDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_XBARA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_XBARB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_XECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1171/periph/PERI_XRDC2.h" projectpath="device/periph"/>
        <file category="include" name="devices/MIMXRT1171/"/>
        <file category="include" name="devices/MIMXRT1171/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1171/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1171/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="1.0.0" condition="device.boot_header.condition_id">
      <description>Device Boot Header</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1171/xip/fsl_flexspi_nor_boot.c" projectpath="xip"/>
        <file category="header" name="devices/MIMXRT1171/xip/fsl_flexspi_nor_boot.h" projectpath="xip"/>
        <file category="include" name="devices/MIMXRT1171/xip/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1171_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1171_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/arm/MIMXRT1171xxxxx_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1171/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/arm/MIMXRT1171xxxxx_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1171/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/arm/MIMXRT1171xxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT1171/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/arm/MIMXRT1171xxxxx_sdram.scf" version="1.0.0" projectpath="MIMXRT1171/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/arm/MIMXRT1171xxxxx_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1171/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/gcc/MIMXRT1171xxxxx_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1171/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/gcc/MIMXRT1171xxxxx_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1171/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/gcc/MIMXRT1171xxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT1171/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/gcc/MIMXRT1171xxxxx_sdram.ld" version="1.0.0" projectpath="MIMXRT1171/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/gcc/MIMXRT1171xxxxx_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1171/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/iar/MIMXRT1171xxxxx_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1171/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/iar/MIMXRT1171xxxxx_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1171/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/iar/MIMXRT1171xxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT1171/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/iar/MIMXRT1171xxxxx_sdram.icf" version="1.0.0" projectpath="MIMXRT1171/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1171xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1171/iar/MIMXRT1171xxxxx_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1171/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1171" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1171</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1171/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1171/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1171/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1171/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1171/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1171/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1171/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1171/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1171/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT1171_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1171/iar/startup_MIMXRT1171.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1171/gcc/startup_MIMXRT1171.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1171/arm/startup_MIMXRT1171.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1171_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT1171_system</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1171/system_MIMXRT1171.c" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1171/system_MIMXRT1171.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1171/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.3.2" condition="driver.adc_etc.condition_id">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_adc_etc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_adc_etc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
