vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-dbi" Cversion="1.0.0" condition="driver.dc-fb-dbi.condition_id">
      <description>Driver dc-fb-dbi</description>
      <RTE_Components_h>
#ifndef MCUX_DBI_LEGACY
#define MCUX_DBI_LEGACY 0
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-dsi-cmd" Cversion="1.1.1" condition="driver.dc-fb-dsi-cmd.condition_id">
      <description>Driver dc-fb-dsi-cmd</description>
      <files>
        <file category="header" name="components/video/display/dc/dsi_cmd/fsl_dc_fb_dsi_cmd.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/dsi_cmd/fsl_dc_fb_dsi_cmd.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/dsi_cmd/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-lcdifv2" Cversion="1.0.2" condition="driver.dc-fb-lcdifv2.condition_id">
      <description>Driver dc-fb-lcdifv2</description>
      <files>
        <file category="header" name="components/video/display/dc/lcdifv2/fsl_dc_fb_lcdifv2.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/lcdifv2/fsl_dc_fb_lcdifv2.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/lcdifv2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-ssd1963" Cversion="1.0.2" condition="driver.dc-fb-ssd1963.condition_id">
      <description>Driver dc-fb-ssd1963</description>
      <files>
        <file category="header" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcdc_soc" Cversion="2.1.2" condition="driver.dcdc_2.condition_id">
      <description>DCDC SOC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_dcdc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_dcdc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcic" Cversion="2.0.2" condition="driver.dcic.condition_id">
      <description>DCIC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_dcic.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_dcic.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.1" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-adv7535" Cversion="1.0.1" condition="driver.display-adv7535.condition_id">
      <description>Driver display-adv7535</description>
      <files>
        <file category="header" name="components/video/display/adv7535/fsl_adv7535.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/adv7535/fsl_adv7535.c" projectpath="video"/>
        <file category="include" name="components/video/display/adv7535/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-co5300" Cversion="1.0.0" condition="driver.display-co5300.condition_id">
      <description>Driver display-co5300</description>
      <files>
        <file category="header" name="components/video/display/co5300/fsl_co5300.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/co5300/fsl_co5300.c" projectpath="video"/>
        <file category="include" name="components/video/display/co5300/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-common" Cversion="1.0.0" condition="driver.display-common.condition_id">
      <description>Driver display-common</description>
      <files>
        <file category="header" name="components/video/display/fsl_display.h" projectpath="video"/>
        <file category="include" name="components/video/display/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-hx8394" Cversion="1.0.0" condition="driver.display-hx8394.condition_id">
      <description>Driver display-hx8394</description>
      <files>
        <file category="header" name="components/video/display/hx8394/fsl_hx8394.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/hx8394/fsl_hx8394.c" projectpath="video"/>
        <file category="include" name="components/video/display/hx8394/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6161" Cversion="1.0.0" condition="driver.display-it6161.condition_id">
      <description>Driver display-it6161</description>
      <files>
        <file category="header" name="components/video/display/it6161/fsl_it6161.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/fsl_it6161.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/hdmi_tx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/hdmi_tx.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/mipi_rx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/mipi_rx.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6161/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6263" Cversion="1.0.1" condition="driver.display-it6263.condition_id">
      <description>Driver display-it6263</description>
      <files>
        <file category="header" name="components/video/display/it6263/fsl_it6263.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6263/fsl_it6263.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6263/"/>
      </files>
    </component>
