vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1171_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd" Cversion="1.0.2" condition="driver.display-mipi-dsi-cmd.condition_id">
      <description>Driver display-mipi-dsi-cmd</description>
      <files>
        <file category="header" name="components/video/display/mipi_dsi_cmd/fsl_mipi_dsi_cmd.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/mipi_dsi_cmd/fsl_mipi_dsi_cmd.c" projectpath="video"/>
        <file category="include" name="components/video/display/mipi_dsi_cmd/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm67162" Cversion="1.0.2" condition="driver.display-rm67162.condition_id">
      <description>Driver display-rm67162</description>
      <files>
        <file category="header" name="components/video/display/rm67162/fsl_rm67162.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm67162/fsl_rm67162.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm67162/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm67191" Cversion="1.1.0" condition="driver.display-rm67191.condition_id">
      <description>Driver display-rm67191</description>
      <files>
        <file category="header" name="components/video/display/rm67191/fsl_rm67191.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm67191/fsl_rm67191.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm67191/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm68191" Cversion="1.1.0" condition="driver.display-rm68191.condition_id">
      <description>Driver display-rm68191</description>
      <files>
        <file category="header" name="components/video/display/rm68191/fsl_rm68191.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm68191/fsl_rm68191.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm68191/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm68200" Cversion="1.1.1" condition="driver.display-rm68200.condition_id">
      <description>Driver display-rm68200</description>
      <files>
        <file category="header" name="components/video/display/rm68200/fsl_rm68200.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm68200/fsl_rm68200.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm68200/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm692c9" Cversion="1.1.0" condition="driver.display-rm692c9.condition_id">
      <description>Driver display-rm692c9</description>
      <files>
        <file category="header" name="components/video/display/rm692c9/fsl_rm692c9.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm692c9/fsl_rm692c9.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm692c9/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rpi" Cversion="1.0.0" condition="driver.display-rpi.condition_id">
      <description>Driver display-rpi</description>
      <files>
        <file category="header" name="components/video/display/rpi/fsl_rpi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rpi/fsl_rpi.c" projectpath="video"/>
        <file category="include" name="components/video/display/rpi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-sn65dsi83" Cversion="1.0.0" condition="driver.display-sn65dsi83.condition_id">
      <description>Driver display-sn65dsi83</description>
      <files>
        <file category="header" name="components/video/display/sn65dsi83/fsl_sn65dsi83.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/sn65dsi83/fsl_sn65dsi83.c" projectpath="video"/>
        <file category="include" name="components/video/display/sn65dsi83/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.3" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.5" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ektf2k" Cversion="1.0.0" condition="driver.ektf2k.condition_id">
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/ektf2k/fsl_ektf2k.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ektf2k/fsl_ektf2k.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ektf2k/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enc" Cversion="2.2.1" condition="driver.enc.condition_id">
      <description>ENC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_enc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_enc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enet" Cversion="2.9.3" condition="driver.enet.condition_id">
      <description>ENET Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1171/drivers/fsl_enet.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1171/drivers/fsl_enet.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1171/drivers/"/>
      </files>
    </component>
